bench/trimbench/res.xfs.nodiscard.swraid.crucial.linux65.socket2/o.test.out
nohup: ignoring input
Create /data/m/f.1 at Tue Jun 18 11:21:43 PM UTC 2024
1048576+0 records in
1048576+0 records out
1099511627776 bytes (1.1 TB, 1.0 TiB) copied, 3223.76 s, 341 MB/s
-rw-rw-r-- 1 mdcallag mdcallag 1.0T Jun 19 00:15 /data/m/f.1
Sleep for 30 seconds after creating /data/m/f.1 at Wed Jun 19 12:15:27 AM UTC 2024
Existing /data/m/f.2 is large enough
List kernel
Linux socket2 6.5.0-35-generic #35~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Tue May  7 09:00:52 UTC 2 x86_64 x86_64 x86_64 GNU/Linux
List mount options for filesystems
sysfs on /sys type sysfs (rw,nosuid,nodev,noexec,relatime)
proc on /proc type proc (rw,nosuid,nodev,noexec,relatime)
udev on /dev type devtmpfs (rw,nosuid,relatime,size=32720388k,nr_inodes=8180097,mode=755,inode64)
devpts on /dev/pts type devpts (rw,nosuid,noexec,relatime,gid=5,mode=620,ptmxmode=000)
tmpfs on /run type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
efivarfs on /sys/firmware/efi/efivars type efivarfs (rw,nosuid,nodev,noexec,relatime)
/dev/sda2 on / type ext4 (rw,relatime)
securityfs on /sys/kernel/security type securityfs (rw,nosuid,nodev,noexec,relatime)
tmpfs on /dev/shm type tmpfs (rw,nosuid,nodev,inode64)
tmpfs on /run/lock type tmpfs (rw,nosuid,nodev,noexec,relatime,size=5120k,inode64)
cgroup2 on /sys/fs/cgroup type cgroup2 (rw,nosuid,nodev,noexec,relatime,nsdelegate,memory_recursiveprot)
pstore on /sys/fs/pstore type pstore (rw,nosuid,nodev,noexec,relatime)
bpf on /sys/fs/bpf type bpf (rw,nosuid,nodev,noexec,relatime,mode=700)
systemd-1 on /proc/sys/fs/binfmt_misc type autofs (rw,relatime,fd=29,pgrp=1,timeout=0,minproto=5,maxproto=5,direct,pipe_ino=20760)
hugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,pagesize=2M)
mqueue on /dev/mqueue type mqueue (rw,nosuid,nodev,noexec,relatime)
debugfs on /sys/kernel/debug type debugfs (rw,nosuid,nodev,noexec,relatime)
tracefs on /sys/kernel/tracing type tracefs (rw,nosuid,nodev,noexec,relatime)
fusectl on /sys/fs/fuse/connections type fusectl (rw,nosuid,nodev,noexec,relatime)
configfs on /sys/kernel/config type configfs (rw,nosuid,nodev,noexec,relatime)
ramfs on /run/credentials/systemd-sysusers.service type ramfs (ro,nosuid,nodev,noexec,relatime,mode=700)
/var/lib/snapd/snaps/core20_2264.snap on /snap/core20/2264 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/core20_2318.snap on /snap/core20/2318 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_27948.snap on /snap/lxd/27948 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/lxd_28373.snap on /snap/lxd/28373 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21759.snap on /snap/snapd/21759 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/var/lib/snapd/snaps/snapd_21465.snap on /snap/snapd/21465 type squashfs (ro,nodev,relatime,errors=continue,threads=single,x-gdu.hide)
/dev/sdb on /data2 type ext4 (rw,noatime,nodiratime,discard)
/dev/sda1 on /boot/efi type vfat (rw,relatime,fmask=0022,dmask=0022,codepage=437,iocharset=iso8859-1,shortname=mixed,errors=remount-ro)
binfmt_misc on /proc/sys/fs/binfmt_misc type binfmt_misc (rw,nosuid,nodev,noexec,relatime)
tmpfs on /run/snapd/ns type tmpfs (rw,nosuid,nodev,noexec,relatime,size=6557228k,mode=755,inode64)
nsfs on /run/snapd/ns/lxd.mnt type nsfs (rw)
tmpfs on /run/user/1000 type tmpfs (rw,nosuid,nodev,relatime,size=6557224k,nr_inodes=1639306,mode=700,uid=1000,gid=1000,inode64)
/dev/md0 on /data type xfs (rw,noatime,nodiratime,attr2,inode64,logbufs=8,logbsize=32k,sunit=1024,swidth=2048,noquota)

Remove /data/m/f.1 at Wed Jun 19 12:15:58 AM UTC 2024
Start fio to read from /data/m/f.2 at Wed Jun 19 12:15:58 AM UTC 2024

iops-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

iops-test-job: (groupid=0, jobs=1): err= 0: pid=1795569: Wed Jun 19 00:17:28 2024
  read: IOPS=151k, BW=588MiB/s (617MB/s)(51.7GiB/90001msec)
    slat (nsec): min=1960, max=91734, avg=2976.71, stdev=1007.55
    clat (nsec): min=391, max=22994k, avg=49562.19, stdev=52169.76
     lat (usec): min=11, max=23026, avg=52.63, stdev=52.18
    clat percentiles (usec):
     |  1.00th=[   42],  5.00th=[   44], 10.00th=[   45], 20.00th=[   47],
     | 30.00th=[   48], 40.00th=[   48], 50.00th=[   49], 60.00th=[   50],
     | 70.00th=[   51], 80.00th=[   52], 90.00th=[   55], 95.00th=[   57],
     | 99.00th=[   65], 99.50th=[   71], 99.90th=[   90], 99.95th=[  101],
     | 99.99th=[  424]
   bw (  KiB/s): min=437008, max=611368, per=100.00%, avg=602745.70, stdev=21634.54, samples=179
   iops        : min=109252, max=152842, avg=150686.46, stdev=5408.64, samples=179
  lat (nsec)   : 500=0.01%
  lat (usec)   : 10=0.01%, 20=0.01%, 50=62.70%, 100=37.24%, 250=0.03%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 50=0.01%
  cpu          : usr=18.91%, sys=54.44%, ctx=3733266, majf=0, minf=32
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=13546520,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=588MiB/s (617MB/s), 588MiB/s-588MiB/s (617MB/s-617MB/s), io=51.7GiB (55.5GB), run=90001-90001msec

Disk stats (read/write):
    md0: ios=13530200/37, merge=0/0, ticks=608492/0, in_queue=608492, util=100.00%, aggrios=6773260/14, aggrmerge=0/6, aggrticks=304273/3, aggrin_queue=304277, aggrutil=99.87%
  nvme0n1: ios=6773372/15, merge=0/7, ticks=303840/4, in_queue=303845, util=99.86%
  nvme1n1: ios=6773148/14, merge=0/5, ticks=304706/2, in_queue=304709, util=99.87%

run.sh: line 61: kill: (1795541) - No such process